{"class_name": "Functional", "config": {"name": "model", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "ley"}, "registered_name": null, "name": "ley", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 497], "dtype": "float32", "sparse": false, "ragged": false, "name": "politico"}, "registered_name": null, "name": "politico", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 499], "dtype": "float32", "sparse": false, "ragged": false, "name": "autores"}, "registered_name": null, "name": "autores", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 512], "dtype": "float32", "sparse": false, "ragged": false, "name": "titulos"}, "registered_name": null, "name": "titulos", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "law_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 512, "output_dim": 51, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 512]}, "name": "law_embedding", "inbound_nodes": [[["ley", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "politician_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 497, "output_dim": 10, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 497]}, "name": "politician_embedding", "inbound_nodes": [[["politico", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "authors_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 499, "output_dim": 49, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 499]}, "name": "authors_embedding", "inbound_nodes": [[["autores", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "title_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, null], "input_dim": 512, "output_dim": 51, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "registered_name": null, "build_config": {"input_shape": [null, 512]}, "name": "title_embedding", "inbound_nodes": [[["titulos", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 512, 51]}, "name": "flatten", "inbound_nodes": [[["law_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 497, 10]}, "name": "flatten_1", "inbound_nodes": [[["politician_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 499, 49]}, "name": "flatten_2", "inbound_nodes": [[["authors_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 512, 51]}, "name": "flatten_3", "inbound_nodes": [[["title_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "anio"}, "registered_name": null, "name": "anio", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Concatenate", "config": {"name": "concatenados", "trainable": true, "dtype": "float32", "axis": -1}, "registered_name": null, "build_config": {"input_shape": [[null, 26112], [null, 4970], [null, 24451], [null, 26112], [null, 1]]}, "name": "concatenados", "inbound_nodes": [[["flatten", 0, 0, {}], ["flatten_1", 0, 0, {}], ["flatten_2", 0, 0, {}], ["flatten_3", 0, 0, {}], ["anio", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "relu_1", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 81646]}, "name": "relu_1", "inbound_nodes": [[["concatenados", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "relu_2", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "relu_2", "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "relu_3", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "relu_3", "inbound_nodes": [[["relu_2", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dense", "config": {"name": "voto", "trainable": true, "dtype": "float32", "units": 5, "activation": "linear", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128]}, "name": "voto", "inbound_nodes": [[["relu_3", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Activation", "config": {"name": "voto_softmax", "trainable": true, "dtype": "float32", "activation": "softmax"}, "registered_name": null, "build_config": {"input_shape": [null, 5]}, "name": "voto_softmax", "inbound_nodes": [[["voto", 0, 0, {}]]]}], "input_layers": [["ley", 0, 0], ["politico", 0, 0], ["autores", 0, 0], ["anio", 0, 0], ["titulos", 0, 0]], "output_layers": [["voto_softmax", 0, 0]]}, "keras_version": "2.14.0", "backend": "tensorflow"}